SunCity/src/ExchangePlans/ОбменРозницаБухгалтерияПредприятия30/ОбменРозницаБухгалтерияПредприятия30.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="15a83685-50d0-43c6-b1ff-e0cc1eae43a7">
  <name>ОбменРозницаБухгалтерияПредприятия30</name>
  <comment>Синхронизация данных между конфигурациями &quot;Розница для Казахстана&quot;, редакция 2.3 и &quot;Бухгалтерия для Казахстана&quot;, редакция 3.0</comment>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьРозничныеЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьЦеныХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНачислениеЗарплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиСписания</name>
    <type>
      <types>EnumRef.СпособыПередачиСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОтчетОРозничныхПродажахКакРеализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтветственногоКакАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

SunCity/src/ExchangePlans/ОбменРозницаБухгалтерияПредприятия30/Forms/ФормаНастройкиУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтаФорма, "ОбменРозницаБухгалтерияПредприятия30");
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборПриИзменении(Элемент)
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередаватьРозничныеЦеныПриИзменении(Элемент)
	
	Если НЕ ПередаватьРозничныеЦены Тогда
		ПередаватьЦеныХарактеристик = Ложь;
	КонецЕсли;
   УстановитьВидимостьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Элементы.ОтборПоОрганизациям.Видимость	= ИспользоватьОтборПоОрганизациям;
    Элементы.ПередаватьЦеныХарактеристик.Видимость = ПередаватьРозничныеЦены И ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");

КонецПроцедуры

#КонецОбласти
